<script lang="ts" setup></script>

<template>
  <div class="scroll_1">
    <ins></ins>
    <h1>春去，春回，花开花又落，此四时之轮回，何须叹。</h1>
    <p>
      四时之景，万物轮回，感之，叹之，以心见之，乃万物之变；以眼观之，乃四时之景，将万物皆系于一物之上，为生命。由心而感，以观四时。
    </p>
    <p>
      在如此快节奏的社会里，哪怕仅仅是一个短暂的驻足也会打乱整天的计划，而走在车水马龙中的我们便任凭那美妙的四季一次又一次的从身边路过，慢慢地，人们就只知道到了某个季节，应该如何的增添衣物，却无人用心记录下这些美好的瞬间。
    </p>
    <p>
      万物之景始于春，多少人待得春风来抹去冬日里的那最后一簇寒冷，带来春日的温暖，多少人待得春雨来滋润秋日里所凋零的花朵，绽放出春的美丽。归南的大雁欣然飞回，为湛蓝的天空添上了一抹纯真的颜色。泥泞的小路旁映衬着点点花朵正为路上的行人撒下些许殷红，来消除旅途中的疲乏。花瓣上剔透的露珠悄然落在旅人的身上，不时散发着淡淡的清香，耳边偶尔传来几声悦耳的鸟鸣，这才让人发觉这正是秋日里最美的写照。
    </p>
    <p>
      万物之景始于春，多少人待得春风来抹去冬日里的那最后一簇寒冷，带来春日的温暖，多少人待得春雨来滋润秋日里所凋零的花朵，绽放出春的美丽。归南的大雁欣然飞回，为湛蓝的天空添上了一抹纯真的颜色。泥泞的小路旁映衬着点点花朵正为路上的行人撒下些许殷红，来消除旅途中的疲乏。花瓣上剔透的露珠悄然落在旅人的身上，不时散发着淡淡的清香，耳边偶尔传来几声悦耳的鸟鸣，这才让人发觉这正是秋日里最美的写照。
    </p>
    <p>
      万物之景始于春，多少人待得春风来抹去冬日里的那最后一簇寒冷，带来春日的温暖，多少人待得春雨来滋润秋日里所凋零的花朵，绽放出春的美丽。归南的大雁欣然飞回，为湛蓝的天空添上了一抹纯真的颜色。泥泞的小路旁映衬着点点花朵正为路上的行人撒下些许殷红，来消除旅途中的疲乏。花瓣上剔透的露珠悄然落在旅人的身上，不时散发着淡淡的清香，耳边偶尔传来几声悦耳的鸟鸣，这才让人发觉这正是秋日里最美的写照。
    </p>
    <p>
      万物之景始于春，多少人待得春风来抹去冬日里的那最后一簇寒冷，带来春日的温暖，多少人待得春雨来滋润秋日里所凋零的花朵，绽放出春的美丽。归南的大雁欣然飞回，为湛蓝的天空添上了一抹纯真的颜色。泥泞的小路旁映衬着点点花朵正为路上的行人撒下些许殷红，来消除旅途中的疲乏。花瓣上剔透的露珠悄然落在旅人的身上，不时散发着淡淡的清香，耳边偶尔传来几声悦耳的鸟鸣，这才让人发觉这正是秋日里最美的写照。
    </p>
  </div>
</template>

<style lang="scss" scoped>
  .scroll_1 {
    width: 100%;
    height: 100%;
    overflow: auto;
    /* 有兼容性问题，目前在谷歌浏览器上测试通过  */
    scroll-timeline: --scroll block;
    scroll-snap-type: mandatory;
    ins {
      display: block;
      border-top: 2px solid green;
      animation-name: widthExpand;
      animation-duration: 1ms; /* Firefox需要设置这个*/
      animation-timeline: --scroll;
      position: sticky;
      top: 0;
    }
  }
  @keyframes widthExpand {
    from {
      width: 0%;
    }
    to {
      width: 100%;
    }
  }
</style>
